app/controllers/tasks_controller.rb

  def index
    @sort_order = params[:order] == 'desc' ? 'desc' : 'asc'
    @tasks = Task.order(status: @sort_order)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."status" DESC

  def new
    @task = Task.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def edit
    @task = Task.find(params[:id])
    @categories = Category.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "is_completed", "category_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Exam"], ["is_completed", nil], ["category_id", 2], ["created_at", "2024-10-08 01:45:02.785336"], ["updated_at", "2024-10-08 01:45:02.785336"], ["status", 0]]

  def update
    @task = Task.find(params[:id])
    @categories = Category.all
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ?, "status" = ? WHERE "tasks"."id" = ?  [["is_completed", 0], ["updated_at", "2024-10-08 01:45:11.552847"], ["status", 1], ["id", 5]]

  def destroy
    @task.destroy!
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]